0Bu/daikin-altherma-esp32/main/config.cpp
bool config_save(const Config& requested, bool require_link) {
    // Persist user settings (WiFi + MQTT + syslog + NTP) and the X10A link cache (RX/TX pins +
    // protocol). The MODEL is intentionally NOT written — profile + fingerprint (fp_*) are re-derived
    // every boot.
    //
    // ATOMIC credential/service save (F02). The credential + service fields go into ONE CRC-checked
    // blob (logic/config_store.hpp) written with a single nvs_set_blob. That entry is atomic — either
    // the whole new blob lands or the previous one survives — so the save is all-or-nothing across
    // both a mid-write NVS failure AND a power cut, with no per-key rollback and no write-ordering to
    // get right (the old multi-commit save needed both, and still left a partial state on a rollback
    // that could not complete). Every runtime call is serialized on the httpd task; initial HomeHub
    // discovery is the one boot call and finishes before httpd starts. The poll task uses a
    // revision-checked field-owned commit, so it can never revert a credential change.
    // Diagnostics consent and its generation ride atomically with every dependent source. The
    // heating-curve diagnosis still derives its remaining prerequisites from the MQTT room source
    // and active HomeHub on every evaluation; forecast remains optional comparison evidence.
    // Serialize the NVS transaction with detection's field-owned commit. The flash write is rare
    // and may hold readers briefly, but this is the only way RAM and the atomic link entry can keep
    // one ordering when /set_hp races a long-running detection sweep.
    Lock lk(g_mtx);
    Config c = requested;
    if (!require_link && requested.runtime_revision != g_cfg.runtime_revision) {
        // The only concurrent writer is auto-detection. An unrelated HTTP form owns service fields,
        // not the detected X10A session, so a snapshot taken before detection must carry forward the
        // newly proven model/link rather than silently reverting them on publication.
        c.profile = g_cfg.profile;
        c.proto = g_cfg.proto;
        c.rx_pin = g_cfg.rx_pin;
        c.tx_pin = g_cfg.tx_pin;
        c.x10a_identity_fp = g_cfg.x10a_identity_fp;
        c.fp_pages = g_cfg.fp_pages;
        c.fp_kw_tenths = g_cfg.fp_kw_tenths;
        c.fp_iu_kw_tenths = g_cfg.fp_iu_kw_tenths;
        c.fp_eeprom = g_cfg.fp_eeprom;
    }
    ConfigBlob b;
    b.wifi_ssid = c.wifi_ssid;                 b.wifi_pass = c.wifi_pass;
    b.wifi_ssid_backup = c.wifi_ssid_backup;   b.wifi_pass_backup = c.wifi_pass_backup;
    b.wifi_rollback_active = c.wifi_rollback_active; b.wifi_rolled_back = c.wifi_rolled_back;
    b.mqtt_uri = c.mqtt_uri;   b.mqtt_user = c.mqtt_user;   b.mqtt_pass = c.mqtt_pass;
    b.mqtt_base = c.mqtt_base;
    b.ref_temp_name = c.ref_temp_name; b.ref_temp_topic = c.ref_temp_topic;
    b.ref_temp_path = c.ref_temp_path; b.ref_temp_time_path = c.ref_temp_time_path;
    b.ref_temp_setpoint_topic = c.ref_temp_setpoint_topic;
    b.ref_temp_time_topic = c.ref_temp_time_topic;
    b.ref_temp_fixed_setpoint_tenths = c.ref_temp_fixed_setpoint_tenths;
    b.ref_temp_setpoint_path = c.ref_temp_setpoint_path;
    b.ref_temp_enabled_path = c.ref_temp_enabled_path;
    b.ref_temp_hvac_mode_path = c.ref_temp_hvac_mode_path;
    b.ref_temp_max_age_s = c.ref_temp_max_age_s;
    b.circulation_name = c.circulation_name;
    b.circulation_topic = c.circulation_topic;
    b.circulation_power_path = c.circulation_power_path;
    b.circulation_time_path = c.circulation_time_path;
    b.circulation_max_age_s = c.circulation_max_age_s;
    b.circulation_on_tenths_w = c.circulation_on_tenths_w;
    b.circulation_off_tenths_w = c.circulation_off_tenths_w;
    b.circulation_confirm_s = c.circulation_confirm_s;
    b.weather_enabled = c.weather_enabled;
    b.weather_latitude_e6 = c.weather_latitude_e6;
    b.weather_longitude_e6 = c.weather_longitude_e6;
    b.diagnostics_enabled = c.diagnostics_enabled;
    b.diagnostics_generation = c.diagnostics_generation;
    b.env3_enabled = c.env3_enabled; b.env3_sda = c.env3_sda; b.env3_scl = c.env3_scl;
    b.board_preset_id = static_cast<int32_t>(c.board_preset_id);
    b.board_user_set = c.board_user_set;
    b.syslog_host = c.syslog_host; b.syslog_port = c.syslog_port; b.ntp_server = c.ntp_server;
    // Board-local hardware rides the same atomic blob: like the credentials it has exactly ONE
    // writer (the httpd task, POST /set_board), so it needs no self-healing per-key treatment — and
    // being in the blob is what makes "save the indicator pin" all-or-nothing rather than a pin
    // written without its polarity.
    b.led_gpio = c.led_gpio; b.led_type = c.led_type; b.led_inverted = c.led_inverted;
    b.btn_gpio = c.btn_gpio; b.btn_active_low = c.btn_active_low;
    // The OTA channel rides the same blob for the same reason: one writer (POST /set_ota, httpd).
    b.ota_channel = ota_channel_to_int(c.ota_channel);
    // The UI language likewise: one writer (POST /set_lang, httpd), one persistent user choice.
    b.ui_lang = ui_lang_to_int(c.ui_lang);
    // The HomeHub Modbus stack rides the same blob. POST /set_hp is its normal writer; the one-time
    // boot discovery writes before httpd starts, so the whole-blob ownership remains serialized.
    b.mb_host           = c.mb_host;
    b.mb_port           = c.mb_port;
    b.mb_unit_id        = c.mb_unit_id;
    b.mb_discovery_done = c.mb_discovery_done;
    // REFUSE TO WRITE A BLOB THIS BUILD COULD NOT READ BACK. The decoder rejects the whole blob if any
    // string exceeds CONFIG_BLOB_MAX_STR, and the fallback is the legacy per-key layout a blob-era
    // device never populated — so writing one does not save a slightly-wrong config, it silently
    // destroys the whole config at the next boot (WiFi, MQTT, syslog, NTP, board, OTA channel,
    // language, ENV III, both MQTT sources, the weather location) and comes up in the setup portal.
    // Checked here rather than trusted from the routes because this is the last point where every
    // field is together, and it is the one guarantee the atomic-blob design rests on.
    if (!config_blob_strings_fit(b)) {
        diag_printf("config: refusing to save — a setting exceeds the %u-byte field limit\n",
                    static_cast<unsigned>(CONFIG_BLOB_MAX_STR));
        return false;
    }
    const std::vector<uint8_t> blob = config_blob_serialize(b);

    const esp_err_t e = nvs_set_blob("cfg", blob.data(), blob.size());
    if (e != ESP_OK) {
        // The atomic write failed, so the PREVIOUS blob is still intact — nothing net saved. Don't
        // publish RAM; the caller turns `false` into a 500 and skips the reboot.
        diag_printf("config: NVS blob write failed key=cfg err=%s — nothing saved\n", esp_err_to_name(e));
        return false;
    }

