0Bu/daikin-altherma-esp32/main/config.cpp
    // The link remains a separate ownership domain, but its four fields are ONE atomic entry. It is
    // written after the service blob so a cache failure never taints an unrelated credential save.
    const std::vector<uint8_t> link = link_blob_serialize(
        LinkBlob{c.rx_pin, c.tx_pin, static_cast<char>(c.proto), c.x10a_identity_fp});
    const esp_err_t link_err = nvs_set_blob("link", link.data(), link.size());
    const bool link_ok = link_err == ESP_OK;
    if (!link_ok)
        diag_printf("config: atomic link-cache write failed after service save (%s; previous link "
                    "remains intact)\n", esp_err_to_name(link_err));
    if (!config_save_succeeded(/*blob_ok=*/true, link_ok, require_link)) {
        // /set_hp owns the link and cannot call this a save when its cache did not land. Do not
        // publish its requested pins to RAM or wake the poll task. (The atomic blob also landed, but
        // /set_hp changed none of its fields; for every other route that blob is the requested save.)
        return false;
    }
    publish_locked(c);
    return true;
}

// ── Field-owned commits (the detection path) ─────────────────────────────────────────────────────
// These exist so the poll task never writes a field it doesn't own. It snapshots the config, then
// spends a whole sweep off-lock probing the bus; committing that stale snapshot back would revert
// any /set_wifi or /set_mqtt that landed meanwhile. See logic/config_model.hpp's ownership note.

bool config_commit_detected_link(const Config& expected, int rx_pin, int tx_pin, Protocol proto,
                                 uint32_t identity_fp, bool& link_saved,
                                 uint32_t& committed_revision) {
    Lock lk(g_mtx);
    if (g_cfg.runtime_revision != expected.runtime_revision) {
        link_saved = false;
        committed_revision = 0;
        return false;
    }

    const bool link_changed = g_cfg.rx_pin != rx_pin || g_cfg.tx_pin != tx_pin ||
                              g_cfg.proto != proto || g_cfg.x10a_identity_fp != identity_fp;
    link_saved = true;
    if (link_changed) {
        const std::vector<uint8_t> link = link_blob_serialize(
            LinkBlob{rx_pin, tx_pin, static_cast<char>(proto), identity_fp});
        link_saved = nvs_set_blob("link", link.data(), link.size()) == ESP_OK;
    }

    // The link is proven by this sweep, so keep using it for the current session even if its cache
    // write failed. The history reset performed by the caller scopes every new RAM/flash record to
    // `identity_fp`; on reboot a stale cached identity mismatches and is rejected fail-closed.
    apply_link(g_cfg, rx_pin, tx_pin, proto, identity_fp);
    g_cfg.runtime_revision = next_revision(g_cfg.runtime_revision);
    committed_revision = g_cfg.runtime_revision;
    return true;
}

bool config_commit_detected_model(uint32_t expected_revision, std::string profile,
                                  uint32_t fp_pages, int fp_kw_tenths, int fp_iu_kw_tenths,
                                  std::string fp_eeprom) {
    Lock lk(g_mtx);
    if (g_cfg.runtime_revision != expected_revision) return false;
    apply_model(g_cfg, std::move(profile), fp_pages, fp_kw_tenths, fp_iu_kw_tenths,
                std::move(fp_eeprom));
    g_cfg.runtime_revision = next_revision(g_cfg.runtime_revision);
    return true;
}

// Whole-struct RAM publish (no NVS). Sole caller is POST /detect (http_config.cpp), which resets
// profile->"auto" + clears the fingerprint: acceptable as a whole-struct write because it runs on the
// httpd task, which OWNS the credential fields (serialized against the other /set_* handlers), so it
// cannot revert them. The poll task must NOT use this — it uses the revision-checked helpers above.
void config_set_runtime(const Config& c) { publish(c); }

// Kconfig-derived hardware facts (see config.hpp). Kept here — the one file that already owns the
// CONFIG_* → link mapping — so board_pins' octal_spi/reserved inputs have a single source of truth
// rather than a #if block duplicated across http_status.cpp, http_config.cpp and config_load().
bool hw_octal_spi() {
#if defined(CONFIG_ESPTOOLPY_OCT_FLASH) || defined(CONFIG_SPIRAM_MODE_OCTAL)
    return true;
#else
    return false;
#endif
}

} // namespace daik
